// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function rectangle(a, b) {
//     let result = a * b;
//     // console.log(result);
//     return result
//
// }
//
// rectangle(5, 3);
// const square = (a,b) => a*b;
// console.log(square(10,10))
  


// створити функцію яка обчислює та повертає площу кола з радіусом r
// function circle(p, r) {
//     return (p * r);
//
//
// }
//
// circle(3.14, 7)


// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// function cylinder(cons, r, h) {
//     let result = cons * r * h;
//     console.log(result)
//
// }
// cylinder(6.18,10,25)
// - створити функцію яка приймає масив та виводить кожен його елемент
// let arr = [1, 2, 3];
//
// function foo(array) {
//     for (const mitte of array) {
//         console.log(mitte)
//
//     }
//
// }
//
// foo(arr);

//
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function fifa(text) {
//     document.write(`<p>${text}</p>`)
//
//
// }
// fifa('hello World')
// 
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function foo(text) {
//     document.write(`<ul>
// <li>${text}</li>${text}<li>${text}</li><li>${text}</li>
// </ul>`)
//
// }
// foo('Hello Wolodya')
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13